Tekla Open API Reference for Tekla Structures 2025
StructuresExtender.SetBindPropertyName Method
 Associates the BindPropertyName text with the specified control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetBindPropertyName(
	Control control,
	string value
)
Public Sub SetBindPropertyName (
	control As Control,
	value As String
)
Parameters
control
Type: System.Windows.Forms.Control
The control to associate the BindPropertyName text with.
value
Type: System.String
The BindPropertyName text to associate with the control.
See Also
Reference
StructuresExtender Class
Tekla.Structures.Dialog Namespace